'''
 Проверить, установлен ли пакет pillow в глобальном окружении. Если да — зафиксировать версию.
 Установить самую свежую версию pillow, если ранее она не была установлена. Сделать
 подтверждающий скриншот. Создать и активировать виртуальное окружение.
 Убедиться, что в нем нет пакета pillow. Сделать подтверждающий скриншот.
 Установить в виртуальное окружение pillow версии 7.1.1 (или другой, отличной от самой свежей).
 Сделать подтверждающий скриншот. Деактивировать виртуальное окружение. Сделать подтверждающий
 скриншот.
 Скрины нумеровать двухразрядными числами, например: «01.jpg», «02.jpg».
 Если будут проблемы с pillow - можно поработать с другим пакетом: например, requests.
'''

# 01.JPG (requirements_01.txt) - проверка, установлено ли pillow в глобальном окружении.
# 02.JPG (requirements_02.txt) - подтверждающий скриншот после установки последней версии pillow.
# 03.JPG (requirements_03.txt) - проверка наличия пакета pillow в виртуальном окружении.
# 04.JPG (requirements_04.txt) - подтверждающий скриншот после установки пакета pillow версии 7.1.1 в виртуальном окружении.
# 05.JPG - деактивация виртуального окружения.
# requirements_05.txt - проверка версии пакета pillow
