'''
Представлен список чисел. Необходимо вывести те его элементы, значения которых
больше предыдущего, например:

#    src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
#    result = [12, 44, 4, 10, 78, 123]
#    ```

Подсказка: использовать возможности python, изученные на уроке.

'''


src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

result = []
el = 0

while el < len(src):
    a = int(src[el])
    el += 1
    if el == len(src):
        break
    b = int(src[el])
    if b > a:
        result.append(src[el])
        continue
    continue
print(result)

